{
    "intro": {
        "_id": "66a53b24663ec448ac2b1f31",
        "welcomeText": "Hi I'm",
        "firstName": "Lokesh",
        "lastName": "Chaudhari",
        "caption": "I craft solutions!!",
        "description": "I'm a junior computer engineering student with hands-on experience in application development and problem-solving..."
    },
    "about": {
        "_id": "66a547c4663ec448ac477de6",
        "imgUrl": "",
        "description1": " I'm a passionate computer engineering junior with experience in full-stack development, machine learning, algorithms, andproblem-solving. I'm a founder of an educational platform Saarthi, and have developed and contributed to open-source projects and medium articles. I have previously interned for SDE roles where I worked on diverse technologies to solve challenging problems . Additionally, I have headed technical, research, and relations teams across committees while in college. I love developing innovative solutions and working on challenging tasks.",
        "description2": ""
    },
    "projects": [
        {
            "_id": "66a54d1d663ec448ac5356ee",
            "image": "./iic.png",
            "title": "IIC Website",
            "description1": "A full-stack system for workflow automation, driving operational efficiency and user satisfaction.",
            "description2" : "This project revolutionizes report management and workflow automation in a college ecosystem. It features automated report generation, cutting preparation time by 70%, modular editing for reduced rework, and an email-based approval workflow that improves turnaround by 40%. The platform also includes an event gallery boosting engagement by 25% and committee activity analytics for strategic growth. With real-time data, responsive design, and user-friendly interfaces, it delivers significant operational efficiency and enhanced stakeholder engagement.",
            "link": "https://iic.spit.ac.in",
            "technology": [
                "HTML",
                "CSS",
                "Tailwind",
                "JavaScript",
                "React.js",
                "Node.js",
                "Express",
                "MongoDB",
                "Mongoose"
            ]
        },
        {
            "_id": "66a54d1d663ec448ac5356ee",
            "image": "./saarthi.png",
            "title": "Saarthi",
            "description1": "An AI-powered learning platform with personalized learning experience.",
            "description2": "This project redefines personalized learning by integrating advanced AI technologies with modern web tools. It features AI-enhanced search for precise educational content, LLM-powered real-time doubt resolution, and dynamic YouTube video analysis with contextual chat support. A built-in code editor with Judge0 and Quill enables coding, multimedia note-taking, and AI-driven suggestions. With robust backend systems for hosting, rate limiting, and mailing, the platform delivers an innovative, efficient learning experience that bridges knowledge acquisition and application.",
            "link": "https://saarthi.xyz",
            "technology": [
                "Tailwind",
                "JavaScript",
                "React.js",
                "Node.js",
                "Express",
                "MongoDB",
                "Mongoose",
                "LangChain",
                "LLM"
            ]
        },
        {
            "_id": "66a54d1d663ec448ac5356ee",
            "image": "./leetcoders.png",
            "title": "Leetcoders",
            "description1": "A community platform for coders",
            "description2": "This project is a community-driven platform designed to enhance growth and collaboration for coders practicing on LeetCode. It features leaderboards, personalized goal tracking, friend challenges, and automated progress tracking for LeetCode profiles and challenges. With DCC reminders, it helps users stay consistent and track their growth effectively. Built on a scalable full-stack architecture, the platform ensures real-time data synchronization, analytics, and a seamless user experience.",
            "link": "https://leetcoders.xyz",
            "technology": [
                "Tailwind",
                "JavaScript",
                "React.js",
                "Node.js",
                "Express",
                "MongoDB",
                "Mongoose",
                "GraphQL"
            ]
        },
        {
            "_id": "66a54d1d663ec448ac5356ee",
            "image": "./lokcode.png",
            "title": "My Portfolio",
            "description1": "A dynamic portfolio website to showcase my skills, experiences and projects.",
            "description2": "This dynamic application includes features such as admin login, dynamic content management, and real-time data integration. The project enables the admin to customize the portfolio website easily and update data effortlessly. It utilizes the GitHub API to fetch the latest data, ensuring the portfolio is always up-to-date. Built with a focus on flexibility and ease of use, it incorporates user-friendly design and efficient backend operations.",
            "link": "https://lokcode.xyz",
            "technology": [
                "HTML",
                "CSS",
                "JavaScript",
                "Tailwind",
                "React.js",
                "Node.js",
                "Express",
                "MongoDB",
                "Mongoose"
            ]
        },
        {
            "_id": "66a54d1d663ec448ac5356ee",
            "image": "https://github.com/lokeshch185/AI-codeGenerator/blob/main/static/Screenshot.png?raw=true",
            "title": "AI-codeGenerator",
            "description1": "An AI-based project to generate structured code files for small-scale applications.",
            "description2": "This project employes Google's Generative AI Gemini API to generate applications. It dynamically creates Python applications and respective scripts along with the file structure and folders based on user-defined requirements using natural language processing. Just give the app an idea of what you want to build today, and watch the magic happen!!",
            "link": "https://github.com/lokeshch185/AI-codeGenerator",
            "technology": [
                "HTML",
                "CSS",
                "JavaScript",
               "Flask",
                "Python",
                "Gemini API"
            ]
        }
    ],
    "experiences": [
        {
            "_id": "66a6acbd300f5b6208ad6590",
            "title": "SDE Intern",
            "icon": "./sptbi.jpg",
            "date": "July 2024 - August 2024",
            "company": "SPTBI",
            "description": "Led a team of developers to create a dynamic and customizable portfolio website for professors, leveraging React for the front-end and Node.js for the back-end. Integrated a robust admin page for adding and updating data, using MongoDB for efficient data management. Deployed the application on a private server using Nginx and PM2, optimizing performance on a Linux system. Gained hands-on experience in full-stack development, server management, and leadership skills by coordinating team efforts, managing project timelines, and ensuring code quality through code reviews and best practices. This project enhanced my technical expertise in web development, database management, and deployment strategies, while also improving my ability to lead and collaborate effectively within a team.",
            "skills": [
                "react",
                "node",
                "html",
                "javascript",
                "css",
                "tailwind",
                "Nginx",
                "PM2",
                "Linux"
            ],
            "__v": 0
        },
        {
            "_id": "66a54579663ec448ac427240",
            "icon": "./smowcode.jpg",
            "title": "SDE Intern",
            "company": "Smowcode, Mumbai",
            "description": "Developed and integrated a robust API for the main product, utilizing jQuery to streamline the process. Implemented comprehensive input validation to ensure data integrity and optimized the user experience for seamless interaction. Designed and managed multiple API endpoints, and conducted rigorous testing to ensure reliability and performance. Significantly improving the overall functionality and user satisfaction",
            "date": "June 2024 - July 2024",
            "skills": [
                "jQuery",
                "jQuery UI",
                "CSS",
                "HTML",
                "python"
            ]
        },
        {
            "_id": "66a54579663ec448ac427242",
            "icon": "./iicspit.jpg",
            "title": "SDE Intern",
            "company": "Institution's Innovation Council, Sardar Patel Institute of Technology, Mumbai",
            "description": "Developed and deployed the official website of the IIC, SPIT to facilitate efficient management of committees-driven event reports, including functionalities for report generation, verification, and analysis. ",
            "date": "February 2024 - May 2024",
            "skills": [
                "Node.js",
                "MongoDB",
                "JavaScript",
                "React.js",
                "Mongoose",
                "Express",
                "Nginx",
                "PM2"
            ]
        },
        {
            "_id": "66a54579663ec448ac427241",
            "icon": "./tedx.jpg",
            "title": "Creative Head",
            "company": "TEDx SPIT, Mumbai",
            "description": "Overseeing the creative aspects of TEDx events, including designing promotional materials and managing visual content.",
            "date": "December 2023 - December 2024",
            "skills": [
                "Canva",
                "Adobe Photoshop",
                "Graphic Design",
                "Creative Direction"
            ]
        },
        {
            "_id": "66a54579663ec448ac427243",
            "icon": "./oculus.jpg",
            "title": "Head of Marketing",
            "company": "Oculus S.P.I.T",
            "description": "Led a team to gather data on potential sponsors, successfully contacting and securing sponsorships using strategic communication.",
            "date": "December 2023 - March 2024",
            "skills": [
                "Research",
                "Communication",
                "Marketing Strategy"
            ]
        },
        {
            "_id": "66a54579663ec448ac427243",
            "icon": "./spit.jpg",
            "title": "Training & Placements Coordinator",
            "company": "TPO, SPIT",
            "description": "Led the automation team in streamlining the lead generation process through PowerAutomate, enhancing efficiency and accuracy. Played a pivotal role in the research team, driving strategic initiatives and forging valuable connections with multinational corporations (MNCs). Successfully managed and executed placement drives, optimizing recruitment processes and expanding professional opportunities.",
            "date": "August 2023 - Current",
            "skills": [
                "Research",
                "Communication",
                "Marketing Strategy",
                "Automation",
                "Leadership"
            ]
        }
    ],
    "socials": {
        "_id": "669aaf4336d2f8e877cf2359",
        "leetcode": "https://leetcode.com/u/lokcode/",
        "linkedin": "https://www.linkedin.com/in/lokeshch18",
        "github": "https://github.com/lokeshch185",
        "codeforces": "https://codeforces.com/profile/lokc18"
    }
}